src/Catalogs/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>communication_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>communication_type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращенийCoMagic</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ct_cid</Name>
					<Comment>Calltouch Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fitness1c_cid</Name>
					<Comment>Для быстрого получения УИД контрагента в отчетах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ga_cid</Name>
					<Comment>Google Analitics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_cid</Name>
					<Comment>Roistat Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_vid</Name>
					<Comment>Roistat Visit ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>user_agent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_campaign</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_medium</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_source</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_term</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ym_cid</Name>
					<Comment>Yandex Metrics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Comment>РекламнаяПлощадка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентИзВиджетаЛК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОценкиКачестваЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчаствоватьВРассылке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияСтатусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходИзСтатуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходВСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/Мессенджеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Мессенджеры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>facebook</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>instagram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ok</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>vk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>whatsapp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Заявки/Forms/ФормаВыбораКонтактаМессенджера/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИдентификаторЗаявки") Тогда
		ИдентификаторЗаявки				 = Параметры.ИдентификаторЗаявки;
		ЭтотОбъект.ОбъектИдентификации	 = ПолучитьСсылкуОбъектаПоUID("Справочники", "Заявки", ИдентификаторЗаявки);
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторКлиента") Тогда
		ИдентификаторКлиента			 = Параметры.ИдентификаторКлиента;
		ЭтотОбъект.ОбъектИдентификации	 = ПолучитьСсылкуОбъектаПоUID("Справочники", "Контрагенты", ИдентификаторКлиента);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОбъектИдентификации) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДоступныеКаналыОтправки = Документы.РассылкаСообщений.ПолучитьДоступныеДляОтправкиВнешниеСистемыМессенджера(
		ЭтотОбъект.ОбъектИдентификации,
		ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница
	);
	КоличествоДоступныхКаналов = ДоступныеКаналыОтправки.Количество();
	
	Если КоличествоДоступныхКаналов = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не найдены доступные каналы отправки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Для Каждого КаналОтправки Из ДоступныеКаналыОтправки Цикл
		
		ДанныеКанала = Новый Структура;
		ДанныеКанала.Вставить("ИдКлиента"		, КаналОтправки.ИдКлиента);
		ДанныеКанала.Вставить("ВнешняяСистема"	, КаналОтправки.ВнешняяСистема);
		ДанныеКанала.Вставить("НомерМессенджера", КаналОтправки.НомерМессенджера);
		
		ЭтотОбъект.СписокКонтактов.Добавить(
			ДанныеКанала,
			СформироватьПредставлениеКаналаОтправки(КаналОтправки),,
			ПолучитьКартинкуМессенджера(КаналОтправки.ТипВнешнейСистемы)
		);
		
	КонецЦикла;
	
	Элементы.СписокКонтактов.ВысотаВСтрокахТаблицы = КоличествоДоступныхКаналов;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ВыбратьКанал(Команда)
	
	ТекущиеДанные = Элементы.СписокКонтактов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Выберите канал отправки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПерейтиВЧат(Элементы.СписокКонтактов.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает картинку типа внешней системы.
//
Функция ПолучитьКартинкуМессенджера(ТипВнешнейСистемы)
	
	Если ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		Возврат БиблиотекаКартинок.Whatsapp16;
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Telegram Тогда
		Возврат БиблиотекаКартинок.Telegram16;
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.Viber Тогда
		Возврат БиблиотекаКартинок.Viber16;
		
	ИначеЕсли ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.VkontakteApi Тогда
		Возврат БиблиотекаКартинок.Vk16;
		
	КонецЕсли;
	
	Возврат БиблиотекаКартинок.Пустая;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает представление канала отправки.
//
Функция СформироватьПредставлениеКаналаОтправки(КаналОтправки)
	
	Если КаналОтправки.ИдКлиента = "" Тогда
		Представление = КаналОтправки.НаименованиеВнешнейСистемы + " - " + НСтр("ru = 'создать контакт'") + " (" + КаналОтправки.НомерМессенджера + ")";
	Иначе
		Представление = КаналОтправки.НаименованиеВнешнейСистемы + ?(ЗначениеЗаполнено(КаналОтправки.НомерМессенджера), " (" + КаналОтправки.НомерМессенджера + ")", "");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура СписокКонтактовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПерейтиВЧат(Элемент.ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения перехода в чат мессенджера.
//
Процедура ПерейтиВЧат(ДанныеКанала)
	
	ОписаниеОшибки = "";
	ИдСообщения = УстановитьОжиданиеСообщения(ДанныеКанала.ИдКлиента, ДанныеКанала.ВнешняяСистема, ОписаниеОшибки, ЭтотОбъект.ОбъектИдентификации, ДанныеКанала.НомерМессенджера);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ДанныеКанала.ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ДанныеКанала.ВнешняяСистема);
	ДанныеКаналаСтруктура.Вставить("ИдСообщения"	, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки, Объект = Неопределено, НомерТелефона = "")
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		
		ДанныеКонтакта	 = СоздатьКонтактМессенджера(ВнешняяСистема, Объект, НомерТелефона);
		ИдКлиента		 = ДанныеКонтакта.ИдКлиента;
		ИдСообщения		 = ДанныеКонтакта.ИдСообщения;
		
	Иначе
		ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать клиента в мессенджере.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдСообщения;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКонтактМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	Если ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
		НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
		
		ИдКлиента = НомерТелефона + "@c.us";
		
	КонецЕсли;
	
	ИдКлиента	 = ИдКлиента;
	ИдСообщения	 = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ИдКлиента) Тогда
		
		НовыйДиалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
		НовыйДиалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
		НовыйДиалог.ВнешняяСистема	 = ВнешняяСистема;
		НовыйДиалог.ИдКлиента		 = ИдКлиента;
		НовыйДиалог.Начало			 = Дата(2022, 1, 1);
		НовыйДиалог.Окончание		 = Дата(2022, 1, 1);
		
		НовыйДиалог.Записать();
		
		РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
			ИдКлиента,
			Контрагент,
			НомерТелефона,,
			ВнешняяСистема,
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"),,,,
			НовыйДиалог.ИдДиалога
		);
		
		РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
			ИдКлиента,
			ИдСообщения,,,
			НСтр("ru = 'Создан контакт'"),
			Истина,
			Перечисления.Мессенджеры.whatsapp,
			Ложь,
			ТекущаяДатаСеанса(),
			ВнешняяСистема,,,,,,,,,
			НовыйДиалог.ИдДиалога,
			Истина
		);
		
	КонецЕсли;
	
	ДанныеКонтакта = Новый Структура;
	ДанныеКонтакта.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКонтакта.Вставить("ИдСообщения"	, ИдСообщения);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

#КонецОбласти
